Show / Hide Table of Contents
Class GrpcReflectionServiceContractReflection
Holder for reflection information generated from Grpc/GrpcReflectionServiceContract.proto
Inheritance
System.Object
GrpcReflectionServiceContractReflection
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaStatiCa.Plugin.Grpc
Assembly: IdeaStatiCa.Plugin.dll
Syntax
public static class GrpcReflectionServiceContractReflection
Properties
Improve this Doc   View Source
Descriptor
File descriptor for Grpc/GrpcReflectionServiceContract.proto
Declaration
public static FileDescriptor Descriptor { get; }
Property Value
 Type |  Description
 Google.Protobuf.Reflection.FileDescriptor
 Improve this Doc
 View Source